googlecontacts/src/test/resources/artifacts/ESB/config/requests/googlecontacts/esb_batchCreateContactGroups_mandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.googlecontacts">
   <soapenv:Header/>
   <soapenv:Body>
	<urn:batchcreatecontacts>	
      <urn:appName>%s(appName)</urn:appName>
      <urn:userEmail>%s(userEmail)</urn:userEmail>      
      <urn:accessToken>%s(accessToken)</urn:accessToken>
	  <urn:batchGroups>
         <entry>            
            <id>retrieve</id>            
            <type>query</type>            
            <groupId>%s(groupIdRetrieve)</groupId>            			
         </entry>
          <entry>
            <id>create</id>
            <type>insert</type>
            <title>HOOOOOOOOOOOO</title>
            <extendedProperties>
               <extendedProperty name="more info about the group">
                  <info>Nice people.</info>
               </extendedProperty>
               <extendedProperty name="custom" value="customeValue"/>
            </extendedProperties>
         </entry>
         <entry>
            <id>update</id>
            <type>update</type>
            <groupId>%s(groupIdUpdate)</groupId>
            <title>Connectors</title>
            <content>Changed group content</content>
            <extendedProperties>
               <extendedProperty name="customVal">
                  <info>customValue</info>
               </extendedProperty>
               <extendedProperty name="customVal2" value="customeValue2"/>
            </extendedProperties>
         </entry>
	  </urn:batchGroups>     
	  <urn:method>batchCreateContactGroups</urn:method>
	 </urn:batchcreatecontacts>	 
   </soapenv:Body>
</soapenv:Envelope>